//---------МЕТОДЫ И ФУНКЦИИ JS-----------//////

//querySelector - поиск по сайту, получение доступа к элементу

// cardTemplate.content - контент элемента cardTempalte
// внутренности тега

// cloneNode(true) - клонировать элемент
// ctrl C, копировать элемент

// append - встраивает один элемент в другой
// placesList.append(cardClone);
// встроить карточку в список

// cardTitle.textContent = "Архыз";
// textContent - меняет содержимое тега(внутренности)

//element.classList-подключится к списку классов элемента
//classList.add - добавить класс элементу
//classList.remove - удалить класс у элемента
//classList.toggle - и удаляет и добавляет класс

/////////////МЕТОДЫ И ФУНКЦИИ JS///////////////

//ЦИКЛ - повторяющиеся действия

// for(создаем счетчик; вопрос для цикла; шаг цикла){
//     //что делать много раз
// }

// x.length  - количество элементов в массиве xx

// ОБРАБОТКА СОБЫТИЙ
// addEventListener()  - добавить датчик или слушатель событий
// кнопка.addEventListener("click", console.log("привет"));
// элемент.добавитьСлушательСобытий("событие", что сделать?)

//Какие бывают события?
// click - клик на что-то
// mouseover - мышка над элементов
// submit - отправка данных

// .style - доступ в css из js

//ФУНКЦИЯ
// алгоритм -> последовательность -> набор шагов, действий
// функция может принимать параметры
// или аргументы
// или мини-переменные
